pressuredrop_ABC/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (10 13 -0.5)
    (50 15 -0.5)
    (50 0 -0.5)
    (10 0 -0.5)
    (10 13 0.5)
    (50 15 0.5)
    (50 0 0.5)
    (10 0 0.5)
);

blocks
(
    hex (0 3 2 1 4 7 6 5) (50 100 1) simpleGrading (2 1 1)

);

edges
(
spline 0 1 ((14 14.043863 -0.5)(22 13.820553 -0.5)(30 13.126578 -0.5)(38 14.090896 -0.5)(46 13.079814 -0.5))
spline 4 5 ((14 14.043863 0.5)(22 13.820553 0.5)(30 13.126578 0.5)(38 14.090896 0.5)(46 13.079814 0.5))

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)

        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    innerBox
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    lowerWall
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
// ************************************************************************* //
