pressuredrop_ABC/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 10 -0.5)
    (300 20 -0.5)
    (300 -20 -0.5)
    (0 -10 -0.5)
    (0 10 0.5)
    (300 20 0.5)
    (300 -20 0.5)
    (0 -10 0.5)
);

blocks
(
    hex (0 3 2 1 4 7 6 5) (20 300 1) simpleGrading (0.5 1.8 1)

);

edges
(
spline 0 1 ((50 19.197142 -0.5)(100 14.967647 -0.5)(150 13.647748 -0.5)(200 14.388670 -0.5)(250 17.348936 -0.5))
spline 4 5 ((50 19.197142 0.5)(100 14.967647 0.5)(150 13.647748 0.5)(200 14.388670 0.5)(250 17.348936 0.5))

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)

        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    innerBox
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
// ************************************************************************* //
