pressuredrop_ABC/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       9850;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       9900;
    }
    innerBox
    {
        type            wall;
        nFaces          100;
        startFace       9950;
    }
    lowerWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       10050;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       10150;
    }
)

// ************************************************************************* //
