pressuredrop_ABC/constant/turbulenceProperties
/*-----------------------------------------------------------------------------------*\
|                                                                                     | 
|    ANSA_VERSION: 13.2.4                                                             | 
|                                                                                     | 
|    file created by  A N S A  Wed Apr 09 09:09:33 2014                               | 
|                                                                                     | 
|    Output from: C:/vcc/cae/backup/cfdcar3/ACOUSTICS/THESIS_2014/Box/ANSA/Box.ansa   | 
|                                                                                     | 
\*-----------------------------------------------------------------------------------*/



FoamFile
{
	version 2.0;
	format ascii;
	class dictionary;
	location "";
	object turbulenceProperties;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

simulationType RASModel;
