pressuredrop_ABC/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ( "libfvMotionSolvers.so" );

/*
solver          velocityLaplacian;
velocityLaplacianCoeffs
{
    diffusivity     directional ( 0 100 0 );
	//diffusivity  uniform;
}
*/

solver          displacementLaplacian;
displacementLaplacianCoeffs
{
    diffusivity     quadratic inversePointDistance (innerBox);
}


// ************************************************************************* //
