pressuredrop_ABC/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	
    innerBox
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    inlet
    {
        type            fixedNormalSlip;
        n               (0 0 0);
    }
    
    outlet
    {
        type            fixedNormalSlip;
        n               (0 0 0);
    }
    
    lowerWall
    {
        type symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
